---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Electrical.TemperatureRatingType
source: html/6a6ae4fb-4c5b-cfd3-1eb6-7cdee0745550.htm
---
# TemperatureRatingType Members

Add a new electrical correction factor type to this temperature rating type. The given temperature
value should be quantified in the document's selected unit of electrical temperature.